In [3]:
import pandas as pd
import polars as pl

In [4]:
data = {
    "id": [1, 2, 3, 4, 5],
    "name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "age": [25, 30, 35, 40, 28],
    "salary": [50000, 60000, 55000, 70000, 65000],
    "dept": ["HR", "IT", "IT", "Finance", "HR"]
}

dpd = pd.DataFrame(data)
dpd

   id     name  age  salary     dept
0   1    Alice   25   50000       HR
1   2      Bob   30   60000       IT
2   3  Charlie   35   55000       IT
3   4    David   40   70000  Finance
4   5      Eve   28   65000       HR

In [5]:
dpl = pl.DataFrame(data)
dpl

shape: (5, 5)
┌─────┬─────────┬─────┬────────┬─────────┐
│ id  ┆ name    ┆ age ┆ salary ┆ dept    │
│ --- ┆ ---     ┆ --- ┆ ---    ┆ ---     │
│ i64 ┆ str     ┆ i64 ┆ i64    ┆ str     │
╞═════╪═════════╪═════╪════════╪═════════╡
│ 1   ┆ Alice   ┆ 25  ┆ 50000  ┆ HR      │
│ 2   ┆ Bob     ┆ 30  ┆ 60000  ┆ IT      │
│ 3   ┆ Charlie ┆ 35  ┆ 55000  ┆ IT      │
│ 4   ┆ David   ┆ 40  ┆ 70000  ┆ Finance │
│ 5   ┆ Eve     ┆ 28  ┆ 65000  ┆ HR      │
└─────┴─────────┴─────┴────────┴─────────┘

In [6]:
dpd['name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: name, dtype: object

In [7]:
dpl['name']

shape: (5,)
Series: 'name' [str]
[
	"Alice"
	"Bob"
	"Charlie"
	"David"
	"Eve"
]

In [8]:
dpl.select('name')

shape: (5, 1)
┌─────────┐
│ name    │
│ ---     │
│ str     │
╞═════════╡
│ Alice   │
│ Bob     │
│ Charlie │
│ David   │
│ Eve     │
└─────────┘

In [9]:
pl.col("name")

In [10]:
dpl.select([pl.col("name"), pl.col("salary")])

shape: (5, 2)
┌─────────┬────────┐
│ name    ┆ salary │
│ ---     ┆ ---    │
│ str     ┆ i64    │
╞═════════╪════════╡
│ Alice   ┆ 50000  │
│ Bob     ┆ 60000  │
│ Charlie ┆ 55000  │
│ David   ┆ 70000  │
│ Eve     ┆ 65000  │
└─────────┴────────┘

In [11]:
dpl.select(['name', 'salary'])

shape: (5, 2)
┌─────────┬────────┐
│ name    ┆ salary │
│ ---     ┆ ---    │
│ str     ┆ i64    │
╞═════════╪════════╡
│ Alice   ┆ 50000  │
│ Bob     ┆ 60000  │
│ Charlie ┆ 55000  │
│ David   ┆ 70000  │
│ Eve     ┆ 65000  │
└─────────┴────────┘

##### select

In [14]:
# ❌❌ ERROR:- AttributeError: 'str' object has no attribute 'mean' ❌❌

# dpl.select(['salary'.mean().alias('avg_salary'),
#             'age'.max().alias('oldest_age')])

In [13]:
dpl.select([pl.col("salary").mean().alias('avg_salary'),
            pl.col("age").max().alias('oldest_age')])

shape: (1, 2)
┌────────────┬────────────┐
│ avg_salary ┆ oldest_age │
│ ---        ┆ ---        │
│ f64        ┆ i64        │
╞════════════╪════════════╡
│ 60000.0    ┆ 40         │
└────────────┴────────────┘